heattubeTests/relaxationFactors/case/Allrun_par
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar

postProcess -func writeCellCentres

#------------------------------------------------------------------------------
